package gui.constant;

public interface CommonConstant {
	/** 面板图标 */
	String ICON_IMAGE = "/resource/image/ico.jpg";
	
	
	
	
	
	
	//======================================================================================================================
	String ABOUT = "==========begin==========\r\n" + 
			"\r\n" + 
			"\r\n" + 
			"\r\n" + 
			"\r\n" + 
			"本程序由JAVA编写\r\n" + 
			"\r\n" + 
			"运行程序需要至少JRE1.8版本\r\n" + 
			"\r\n" + 
			"程序由作者一人编写\r\n" + 
			"\r\n" + 
			"错误和不足在所难免\r\n" + 
			"\r\n" + 
			"但作者是尽心尽力的在做\r\n" + 
			"\r\n" + 
			"本程序的功能是操作文件\r\n" + 
			"\r\n" + 
			"包括文件（夹）的增加（未实现）\r\n" + 
			"\r\n" + 
			"文件（夹）的删除（未实现）\r\n" + 
			"\r\n" + 
			"文件（夹）名（扩展名）的修改（已实现）\r\n" + 
			"\r\n" + 
			"还包括趣味功能（命名一组文件夹）\r\n" + 
			"\r\n" + 
			"实用的文件操作（删除正常无法删除的过多层次的文件夹）\r\n" + 
			"\r\n" + 
			"对文件（夹）名的修改可以批量实现\r\n" + 
			"\r\n" + 
			"而且支持正则\r\n" + 
			"\r\n" + 
			"可以方便的增加或减少文件（夹）名的一部分\r\n" + 
			"\r\n" + 
			"比如删除下载的资源中的下载网站部分\r\n" + 
			"\r\n" + 
			"或者给文件增加上想要的标签、说明等\r\n" + 
			"\r\n" + 
			"趣味功能可以通过给定的txt内容\r\n" + 
			"\r\n" + 
			"生成一组文件夹\r\n" + 
			"\r\n" + 
			"文件夹的名字是txt的内容\r\n" + 
			"\r\n" + 
			"可以组成一首诗或者图案哦\r\n" + 
			"\r\n" + 
			"实用功能像删除路径很深的文件（夹）\r\n" + 
			"\r\n" + 
			"下一步会增加一个统计的功能\r\n" + 
			"\r\n" + 
			"统计一个文件夹下的文件数量，大小，类型等\r\n" + 
			"\r\n" + 
			"也可以统计java文件的总行数和有效行数（非注释行和空行）\r\n" + 
			"\r\n" + 
			"如果喜欢可以打赏作者\r\n" + 
			"\r\n" + 
			"如果有问题或意见或发现bug也请联系作者\r\n" + 
			"\r\n" + 
			"\r\n" + 
			"\r\n" + 
			"\r\n" + 
			"==========分割线==========\r\n" + 
			"\r\n" + 
			"\r\n" + 
			"\r\n" + 
			"\r\n" + 
			"没内容了，加一首歌词吧。。。\r\n" + 
			"\r\n" + 
			"歌曲：爱情转移\r\n" + 
			"\r\n" + 
			"歌手：陈奕迅\r\n" + 
			"\r\n" + 
			"作词：林夕\r\n" + 
			"\r\n" + 
			"作曲：泽日生\r\n" + 
			"\r\n" + 
			"歌词：\r\n" + 
			"\r\n" + 
			"徘徊过多少橱窗 住过多少旅馆 才会觉得分离也并不冤枉\r\n" + 
			"\r\n" + 
			"感情是用来浏览 还是用来珍藏 好让日子天天都过得难忘\r\n" + 
			"\r\n" + 
			"熬过了多久患难 湿了多少眼眶 才能知道伤感是爱的遗产\r\n" + 
			"\r\n" + 
			"流浪几张双人床 换过几次信仰 才让戒指义无反顾的交换\r\n" + 
			"\r\n" + 
			"把一个人的温暖 转移到另一个的胸膛\r\n" + 
			"\r\n" + 
			"让上次犯的错反省出梦想 每个人都是这样 享受过提心吊胆\r\n" + 
			"\r\n" + 
			"才拒绝做爱情待罪的羔羊 回忆是抓不到的月光握紧就变黑暗\r\n" + 
			"\r\n" + 
			"让虚假的背影消失于晴朗 阳光在身上流转 等所有业障被原谅\r\n" + 
			"\r\n" + 
			"爱情不停站 想开往地老天荒 需要多勇敢\r\n" + 
			"\r\n" + 
			"烛光照亮了晚餐 照不出个答案 恋爱不是温馨的请客吃饭\r\n" + 
			"\r\n" + 
			"床单上铺满花瓣 拥抱让它成长 太拥挤就开到了别的土壤\r\n" + 
			"\r\n" + 
			"感情需要人接班 接近换来期望 期望带来失望的恶性循环\r\n" + 
			"\r\n" + 
			"短暂的总是浪漫 漫长总会不满 烧完美好青春换一个老伴\r\n" + 
			"\r\n" + 
			"把一个人的温暖 转移到另一个的胸膛\r\n" + 
			"\r\n" + 
			"让上次犯的错反省出梦想 每个人都是这样 享受过提心吊胆\r\n" + 
			"\r\n" + 
			"才拒绝做爱情代罪的羔羊 回忆是抓不到的月光握紧就变黑暗\r\n" + 
			"\r\n" + 
			"让虚假的背影消失于晴朗 阳光在身上流转 等所有业障被原谅\r\n" + 
			"\r\n" + 
			"爱情不停站 想开往地老天荒 需要多勇敢\r\n" + 
			"\r\n" + 
			"把一个人的温暖 转移到另一个的胸膛\r\n" + 
			"\r\n" + 
			"让上次犯的错反省出梦想 每个人都是这样 享受过提心吊胆\r\n" + 
			"\r\n" + 
			"才拒绝做爱情代罪的羔羊 回忆是抓不到的月光握紧就变黑暗\r\n" + 
			"\r\n" + 
			"让虚假的背影消失于晴朗 阳光在身上流转 等所有业障被原谅\r\n" + 
			"\r\n" + 
			"爱情不停站 想开往地老天荒 需要多勇敢\r\n" + 
			"\r\n" + 
			"你不要失望 荡气回肠是为了 最美的平凡\r\n" + 
			"\r\n" + 
			"\r\n" + 
			"\r\n" + 
			"\r\n" + 
			"==========end==========" +
			"\r\n" + 
			"\r\n" + 
			"\r\n" + 
			"\r\n" + 
			"\r\n" + 
			"\r\n" + 
			"\r\n" + 
			"\r\n" + 
			"\r\n" + 
			"\r\n";
	//======================================================================================================================
}
